grevaillot/svd_tools/headers/STM32H743x/fmc.h
#define FMC_PCR_TCLR_SHIFT		9
#define FMC_PCR_TCLR_MASK		0x0f
/** @defgroup fmc_pcr_tclr TCLR CLE to RE delay. These bits set time from CLE low to RE low in number of KCK_FMC clock cycles. The time is give by the following formula: t_clr = (TCLR + SET + 2) TKCK_FMC where TKCK_FMC is the KCK_FMC clock period Note: Set is MEMSET or ATTSET according to the addressed space.
@{*/
/**@}*/

/** FMC_PCR_ECCEN ECC computation logic enable bit **/
#define FMC_PCR_ECCEN		(1 << 6)

#define FMC_PCR_PWID_SHIFT		4
#define FMC_PCR_PWID_MASK		0x03
/** @defgroup fmc_pcr_pwid PWID Data bus width. These bits define the external memory device width.
@{*/
/**@}*/

/** FMC_PCR_PBKEN NAND Flash memory bank enable bit. This bit enables the memory bank. Accessing a disabled memory bank causes an ERROR on AXI bus **/
#define FMC_PCR_PBKEN		(1 << 2)
/** FMC_PCR_PWAITEN Wait feature enable bit. This bit enables the Wait feature for the NAND Flash memory bank: **/
#define FMC_PCR_PWAITEN		(1 << 1)

/**@}*/

/** @defgroup fmc_sr SR This register contains information about the FIFO status and interrupt. The FMC features a FIFO that is used when writing to memories to transfer up to 16 words of data.This is used to quickly write to the FIFO and free the AXI bus for transactions to peripherals other than the FMC, while the FMC is draining its FIFO into the memory. One of these register bits indicates the status of the FIFO, for ECC purposes.The ECC is calculated while the data are written to the memory. To read the correct ECC, the software must consequently wait until the FIFO is empty.
@{*/

/** FMC_SR_FEMPT FIFO empty. Read-only bit that provides the status of the FIFO **/
#define FMC_SR_FEMPT		(1 << 6)
/** FMC_SR_IFEN Interrupt falling edge detection enable bit **/
#define FMC_SR_IFEN		(1 << 5)
/** FMC_SR_ILEN Interrupt high-level detection enable bit **/
#define FMC_SR_ILEN		(1 << 4)
/** FMC_SR_IREN Interrupt rising edge detection enable bit **/
#define FMC_SR_IREN		(1 << 3)
/** FMC_SR_IFS Interrupt falling edge status The flag is set by hardware and reset by software. Note: If this bit is written by software to 1 it will be set. **/
#define FMC_SR_IFS		(1 << 2)
/** FMC_SR_ILS Interrupt high-level status The flag is set by hardware and reset by software. **/
#define FMC_SR_ILS		(1 << 1)
/** FMC_SR_IRS Interrupt rising edge status The flag is set by hardware and reset by software. Note: If this bit is written by software to 1 it will be set. **/
#define FMC_SR_IRS		(1 << 0)

/**@}*/

/** @defgroup fmc_pmem PMEM The FMC_PMEM read/write register contains the timing information for NAND Flash memory bank. This information is used to access either the common memory space of the NAND Flash for command, address write access and data read/write access.
@{*/


#define FMC_PMEM_MEMHIZ_SHIFT		24
#define FMC_PMEM_MEMHIZ_MASK		0xff
/** @defgroup fmc_pmem_memhiz MEMHIZ Common memory x data bus Hi-Z time These bits define the number of KCK_FMC clock cycles during which the data bus is kept Hi-Z after the start of a NAND Flash write access to common memory space. This is only valid for write transactions:
@{*/
/**@}*/


#define FMC_PMEM_MEMHOLD_SHIFT		16
#define FMC_PMEM_MEMHOLD_MASK		0xff
/** @defgroup fmc_pmem_memhold MEMHOLD Common memory hold time These bits define the number of KCK_FMC clock cycles for write accesses and KCK_FMC+1 clock cycles for read accesses during which the address is held (and data for write accesses) after the command is de-asserted (NWE, NOE), for NAND Flash read or write access to common memory space:
@{*/
/**@}*/


#define FMC_PMEM_MEMWAIT_SHIFT		8
#define FMC_PMEM_MEMWAIT_MASK		0xff
/** @defgroup fmc_pmem_memwait MEMWAIT Common memory wait time These bits define the minimum number of KCK_FMC (+1) clock cycles to assert the command (NWE, NOE), for NAND Flash read or write access to common memory space. The duration of command assertion is extended if the wait signal (NWAIT) is active (low) at the end of the programmed value of KCK_FMC:
@{*/
/**@}*/


#define FMC_PMEM_MEMSET_SHIFT		0
#define FMC_PMEM_MEMSET_MASK		0xff
/** @defgroup fmc_pmem_memset MEMSET Common memory x setup time These bits define the number of KCK_FMC (+1) clock cycles to set up the address before the command assertion (NWE, NOE), for NAND Flash read or write access to common memory space:
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_patt PATT The FMC_PATT read/write register contains the timing information for NAND Flash memory bank. It is used for 8-bit accesses to the attribute memory space of the NAND Flash for the last address write access if the timing must differ from that of previous accesses (for Ready/Busy management, refer to Section20.8.5: NAND Flash prewait feature).
@{*/


#define FMC_PATT_ATTHIZ_SHIFT		24
#define FMC_PATT_ATTHIZ_MASK		0xff
/** @defgroup fmc_patt_atthiz ATTHIZ Attribute memory data bus Hi-Z time These bits define the number of KCK_FMC clock cycles during which the data bus is kept in Hi-Z after the start of a NAND Flash write access to attribute memory space on socket. Only valid for writ transaction:
@{*/
/**@}*/


#define FMC_PATT_ATTHOLD_SHIFT		16
#define FMC_PATT_ATTHOLD_MASK		0xff
/** @defgroup fmc_patt_atthold ATTHOLD Attribute memory hold time These bits define the number of KCK_FMC clock cycles during which the address is held (and data for write access) after the command de-assertion (NWE, NOE), for NAND Flash read or write access to attribute memory space:
@{*/
/**@}*/


#define FMC_PATT_ATTWAIT_SHIFT		8
#define FMC_PATT_ATTWAIT_MASK		0xff
/** @defgroup fmc_patt_attwait ATTWAIT Attribute memory wait time These bits define the minimum number of x KCK_FMC (+1) clock cycles to assert the command (NWE, NOE), for NAND Flash read or write access to attribute memory space. The duration for command assertion is extended if the wait signal (NWAIT) is active (low) at the end of the programmed value of KCK_FMC:
@{*/
/**@}*/


#define FMC_PATT_ATTSET_SHIFT		0
#define FMC_PATT_ATTSET_MASK		0xff
/** @defgroup fmc_patt_attset ATTSET Attribute memory setup time These bits define the number of KCK_FMC (+1) clock cycles to set up address before the command assertion (NWE, NOE), for NAND Flash read or write access to attribute memory space:
@{*/
/**@}*/


/**@}*/

